#include "pch.h"
#include "N维切片参数.h"
#include "下标转索引.h"
#include "是否间断.h"
void N维切片参数(UINT64 基础权重, UINT8 维数, UINT32* 各维尺寸, UINT32* 下标长度, UINT64** 下标, 偏移向量& 偏移, UINT64& 段长度)
{
	段长度 = 1;
	UINT8 满维度;
	for (满维度 = 0; 满维度 < 维数; ++满维度)
	{
		if (下标[满维度])
		{
			if (是否间断(下标[满维度],下标长度[满维度]))
				break;
			else if (下标长度[满维度] != 各维尺寸[满维度])
			{
				段长度 = 下标长度[满维度];
				下标长度[满维度] = 1;
				break;
			}
		}
		基础权重 *= 各维尺寸[满维度];
	}
	if (满维度 == 维数)
	{
		偏移 = 偏移向量::Zero(1);
		段长度 = 基础权重;
	}
	else
	{
		段长度 *= 基础权重;
		下标转索引(基础权重, 维数 - 满维度, 各维尺寸 + 满维度, 下标长度 + 满维度, 下标 + 满维度, 偏移);
	}
}